Revit 2027 API
FabricationPartCompareType Enumeration
 Fabrication Part Comparison Types
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FabricationPartCompareType
Public Enumeration FabricationPartCompareType
public enum class FabricationPartCompareType
type FabricationPartCompareType
Members
Member name | Value | Description
Alias | 25 |  Compare Fabrication Alias field.
Alt | 23 |  Compare Fabrication Alt field.
BoxNo | 18 |  Compare Fabrication Box Number field.
ButtonAlias | 28 |  Compare Fabrication Button Alias field.
CID | 11 |  Compare Fabrication Custom Identifier (CID) number.
CustomData | 27 |  Compare all Fabrication Custom Data fields.
CutType | 1 |  Compare Fabrication Cut Type data.
Description | 10 |  Compare Fabrication Description Field.
Drawing | 20 |  Compare Fabrication Drawing name field.
DuctFacing | 6 |  Compare Fabrication Duct Facing Type.
ETag | 22 |  Compare Fabrication ETag field.
Filename | 9 |  Compare Fabrication Item Filename.
Insulation | 7 |  Compare Fabrication Insulation Material.
InsulationSpecification | 4 |  Compare Fabrication Insulation Specification.
Material | 2 |  Compare Fabrication Material.
MaterialGauge | 5 |  Compare Fabrication Material's Gauge.
Notes | 8 |  Compare Fabrication Notes field.
OrderNo | 19 |  Compare Fabrication Order Number field.
Pallet | 17 |  Compare Fabrication Pallet field.
PCFKey | 26 |  Compare Fabrication PCFKey field.
Section | 14 |  Compare Fabrication Section field.
Service | 16 |  Compare Fabrication Service.
SkinGauge | 13 |  Compare Fabrication Double Skin Material Gauge.
SkinMaterial | 12 |  Compare Fabrication Double Skin Material.
Specification | 3 |  Compare Fabrication Specification.
Spool | 24 |  Compare Fabrication Spool name field.
Status | 15 |  Compare Fabrication Status.
Zone | 21 |  Compare Fabrication Zone field.
See Also
Reference
Autodesk.Revit.DB.Fabrication Namespace